int/resources/objectRepo/xmlTemplates/opera/BlockConfig/req_ChangeNextBlockStatusCodes.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:ChangeNextBlockStatusCodesRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:NextBlockStatusCodeList>
            <v91:NextBlockStatusCode Status="?">
               <v91:NextConfiguredStatusList>
                  <v91:NextBlockStatusCodeInfo Order="?" Status="?"/>
               <v91:NextBlockStatusCodeInfo Order="?" Status="?"/><v91:NextBlockStatusCodeInfo Order="?" Status="?"/><v91:NextBlockStatusCodeInfo Order="?" Status="?"/></v91:NextConfiguredStatusList>
               <v91:NextAvailableStatusList>
                  <v91:NextBlockStatusCodeInfo Order="?" Status="?"/>
               </v91:NextAvailableStatusList>
            </v91:NextBlockStatusCode>
         </v9:NextBlockStatusCodeList>
      </v9:ChangeNextBlockStatusCodesRQ>
   </soapenv:Body>
</soapenv:Envelope>